In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("car_dataset.csv")
df.head()

     brand  km_driven  selling_price
0    Tesla     138767      1796176.0
1   Toyota     129375      2186013.0
2    Tesla     184262      4934096.0
3  Hyundai     141330            NaN
4   Toyota      44504      3660011.0

In [3]:
df.isnull().sum()

brand            0
km_driven        0
selling_price    1
dtype: int64

#### ***Here, selling_price column has 1 null values.***      
#### ***Now, handle these null values using median (or mean).***

In [4]:
median = df.selling_price.median()
median

np.float64(2506903.0)

In [6]:
mean = df.selling_price.mean()
mean

np.float64(2668474.5555555555)

In [7]:
df["selling_price"] = df["selling_price"].fillna(median)
df.head()

     brand  km_driven  selling_price
0    Tesla     138767      1796176.0
1   Toyota     129375      2186013.0
2    Tesla     184262      4934096.0
3  Hyundai     141330      2506903.0
4   Toyota      44504      3660011.0

In [9]:
df.isnull().sum()

brand            0
km_driven        0
selling_price    0
dtype: int64

#### ***Now, there is no NaN values in our dataset.***